{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<SEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 155,
      "content": "PWM",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 162,
      "content": "500ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 163,
      "content": "200ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 170,
      "content": "100ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 181,
      "content": "2000ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 187,
      "content": "1000ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 195,
      "content": "output_push_pull",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 206,
      "content": "output_open_drain",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 209,
      "content": "2MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 230,
      "content": "50MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 234,
      "content": "10MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 293,
      "content": "input_pull_up",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 298,
      "content": "input_floating",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 299,
      "content": "input_pull_down",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 442,
      "content": "CH1",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 445,
      "content": "CH2",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 453,
      "content": "CH4",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 457,
      "content": "CH3",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 666,
      "content": "PB",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 683,
      "content": "PA",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1047,
      "content": "PC",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1225,
      "content": "PD",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1952,
      "content": "25%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1953,
      "content": "50%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1954,
      "content": "75%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1955,
      "content": "100%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1956,
      "content": "GPIO_OUTPUT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1957,
      "content": "GPIO_INPUT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1958,
      "content": "GPIO_TOGGLE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1959,
      "content": "GPIO_READ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1960,
      "content": "UART_INIT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1961,
      "content": "UART_TRANSMIT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1962,
      "content": "UART_RECEIVE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1963,
      "content": "TIMER_DELAY",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1964,
      "content": "TIMER_PWM",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1965,
      "content": "RCC_ENABLE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1966,
      "content": "RCC_APB2ENR",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1967,
      "content": "RCC_APB1ENR",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "Split",
        "pattern": {
          "String": "([A-Z]{2})(\\d{1,2})"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          3
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<BOS>": 2,
      "<EOS>": 3,
      "<SEP>": 4,
      "%": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "A": 18,
      "B": 19,
      "C": 20,
      "D": 21,
      "E": 22,
      "F": 23,
      "G": 24,
      "H": 25,
      "I": 26,
      "J": 27,
      "K": 28,
      "L": 29,
      "M": 30,
      "N": 31,
      "O": 32,
      "P": 33,
      "Q": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "_": 44,
      "a": 45,
      "b": 46,
      "c": 47,
      "d": 48,
      "e": 49,
      "f": 50,
      "g": 51,
      "h": 52,
      "i": 53,
      "j": 54,
      "k": 55,
      "l": 56,
      "m": 57,
      "n": 58,
      "o": 59,
      "p": 60,
      "q": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "v": 66,
      "w": 67,
      "x": 68,
      "y": 69,
      "z": 70,
      "ut": 71,
      "00": 72,
      "in": 73,
      "at": 74,
      "put": 75,
      "it": 76,
      "AR": 77,
      "SAR": 78,
      "USAR": 79,
      "USART": 80,
      "on": 81,
      "ms": 82,
      "se": 83,
      "out": 84,
      "output": 85,
      "ll": 86,
      "200": 87,
      "as": 88,
      "re": 89,
      "ud": 90,
      "ba": 91,
      "baud": 92,
      "IM": 93,
      "TIM": 94,
      "to": 95,
      "le": 96,
      "or": 97,
      "input": 98,
      "pu": 99,
      "al": 100,
      "_pu": 101,
      "ig": 102,
      "er": 103,
      "en": 104,
      "set": 105,
      "an": 106,
      "con": 107,
      "ing": 108,
      "100": 109,
      "USART1": 110,
      "USART3": 111,
      "up": 112,
      "Hz": 113,
      "MHz": 114,
      "USART2": 115,
      "bl": 116,
      "ure": 117,
      "for": 118,
      "fig": 119,
      "config": 120,
      "configure": 121,
      "el": 122,
      "600": 123,
      "0ms": 124,
      "_pull": 125,
      "pin": 126,
      "iti": 127,
      "ad": 128,
      "bit": 129,
      "us": 130,
      "ate": 131,
      "wit": 132,
      "ink": 133,
      "blink": 134,
      "sh": 135,
      "_d": 136,
      "0MHz": 137,
      "ev": 138,
      "ery": 139,
      "th": 140,
      "with": 141,
      "TIM4": 142,
      "TIM3": 143,
      "ay": 144,
      "del": 145,
      "delay": 146,
      "every": 147,
      "setup": 148,
      "500": 149,
      "TIM2": 150,
      "lo": 151,
      "ke": 152,
      "15": 153,
      "PW": 154,
      "PWM": 155,
      "115": 156,
      "115200": 157,
      "op": 158,
      "all": 159,
      "ma": 160,
      "st": 161,
      "500ms": 162,
      "200ms": 163,
      "400": 164,
      "por": 165,
      "port": 166,
      "make": 167,
      "od": 168,
      "ri": 169,
      "100ms": 170,
      "open": 171,
      "38": 172,
      "38400": 173,
      "_push": 174,
      "19": 175,
      "19200": 176,
      "of": 177,
      "ally": 178,
      "ra": 179,
      "57": 180,
      "2000ms": 181,
      "57600": 182,
      "9600": 183,
      "and": 184,
      "_push_pull": 185,
      "output_": 186,
      "1000ms": 187,
      "ali": 188,
      "open_d": 189,
      "ze": 190,
      "initi": 191,
      "alize": 192,
      "initialize": 193,
      "ch": 194,
      "output_push_pull": 195,
      "rain": 196,
      "output_open_d": 197,
      "ck": 198,
      "gg": 199,
      "togg": 200,
      "toggle": 201,
      "als": 202,
      "ve": 203,
      "onally": 204,
      "diti": 205,
      "output_open_drain": 206,
      "ditionally": 207,
      "input_pull": 208,
      "2MHz": 209,
      "dat": 210,
      "data": 211,
      "additionally": 212,
      "then": 213,
      "using": 214,
      "pl": 215,
      "ill": 216,
      "ce": 217,
      "also": 218,
      "sen": 219,
      "top": 220,
      "stop": 221,
      "ro": 222,
      "ell": 223,
      "well": 224,
      "wh": 225,
      "led": 226,
      "wa": 227,
      "plus": 228,
      "use": 229,
      "50MHz": 230,
      "read": 231,
      "pa": 232,
      "whi": 233,
      "10MHz": 234,
      "ds": 235,
      "send": 236,
      "while": 237,
      "tr": 238,
      "wait": 239,
      "seri": 240,
      "bits": 241,
      "serial": 242,
      "dut": 243,
      "duty": 244,
      "sm": 245,
      "ee": 246,
      "ansm": 247,
      "transm": 248,
      "transmit": 249,
      "nel": 250,
      "cy": 251,
      "vi": 252,
      "via": 253,
      "chan": 254,
      "cyc": 255,
      "mill": 256,
      "ive": 257,
      "milli": 258,
      "conds": 259,
      "rece": 260,
      "receive": 261,
      "channel": 262,
      "cycle": 263,
      "blo": 264,
      "_up": 265,
      "millise": 266,
      "CH": 267,
      "block": 268,
      "milliseconds": 269,
      "et": 270,
      "25": 271,
      "rt": 272,
      "flo": 273,
      "wan": 274,
      "want": 275,
      "ow": 276,
      "ating": 277,
      "input_": 278,
      "init": 279,
      "mod": 280,
      "ti": 281,
      "bs": 282,
      "eed": 283,
      "bsud": 284,
      "fl": 285,
      "floating": 286,
      "own": 287,
      "_down": 288,
      "per": 289,
      "cre": 290,
      "create": 291,
      "75": 292,
      "input_pull_up": 293,
      "un": 294,
      "fro": 295,
      "from": 296,
      "50": 297,
      "input_floating": 298,
      "input_pull_down": 299,
      "mode": 300,
      "gp": 301,
      "by": 302,
      "gpi": 303,
      "tx": 304,
      "dri": 305,
      "ign": 306,
      "peri": 307,
      "ur": 308,
      "sta": 309,
      "pause": 310,
      "tim": 311,
      "n2": 312,
      "ena": 313,
      "gpio": 314,
      "sign": 315,
      "get": 316,
      "te": 317,
      "period": 318,
      "drive": 319,
      "ble": 320,
      "n1": 321,
      "timer": 322,
      "clo": 323,
      "clock": 324,
      "enable": 325,
      "ld": 326,
      "ec": 327,
      "rit": 328,
      "gen": 329,
      "erate": 330,
      "generate": 331,
      "dig": 332,
      "rate": 333,
      "os": 334,
      "byte": 335,
      "digit": 336,
      "gh": 337,
      "bu": 338,
      "co": 339,
      "ugh": 340,
      "osc": 341,
      "digital": 342,
      "ring": 343,
      "off": 344,
      "oscill": 345,
      "pr": 346,
      "val": 347,
      "tur": 348,
      "sp": 349,
      "b1": 350,
      "run": 351,
      "swit": 352,
      "switch": 353,
      "ic": 354,
      "state": 355,
      "rough": 356,
      "into": 357,
      "blocking": 358,
      "speed": 359,
      "odu": 360,
      "produ": 361,
      "through": 362,
      "turn": 363,
      "ip": 364,
      "ou": 365,
      "ash": 366,
      "low": 367,
      "produce": 368,
      "pp": 369,
      "flash": 370,
      "oscillate": 371,
      "writ": 372,
      "ould": 373,
      "write": 374,
      "a1": 375,
      "ion": 376,
      "flip": 377,
      "should": 378,
      "art": 379,
      "runn": 380,
      "bring": 381,
      "the": 382,
      "ect": 383,
      "uart": 384,
      "running": 385,
      "9n2": 386,
      "cc": 387,
      "pre": 388,
      "sa": 389,
      "need": 390,
      "rcc": 391,
      "com": 392,
      "a2": 393,
      "assign": 394,
      "a5": 395,
      "a6": 396,
      "8n2": 397,
      "8n1": 398,
      "a3": 399,
      "ent": 400,
      "wut": 401,
      "pare": 402,
      "b9": 403,
      "coming": 404,
      "a0": 405,
      "b7": 406,
      "ple": 407,
      "wuth": 408,
      "9n1": 409,
      "b8": 410,
      "pe": 411,
      "prepare": 412,
      "ge": 413,
      "b6": 414,
      "baudrate": 415,
      "b0": 416,
      "b5": 417,
      "ff": 418,
      "hig": 419,
      "high": 420,
      "a4": 421,
      "incoming": 422,
      "mple": 423,
      "ter": 424,
      "rx": 425,
      "mske": 426,
      "is": 427,
      "nee": 428,
      "buff": 429,
      "a7": 430,
      "inter": 431,
      "ist": 432,
      "du": 433,
      "ue": 434,
      "needs": 435,
      "signals": 436,
      "pprt": 437,
      "dsta": 438,
      "rn": 439,
      "sl": 440,
      "stall": 441,
      "CH1": 442,
      "po": 443,
      "interval": 444,
      "CH2": 445,
      "periodic": 446,
      "pro": 447,
      "repe": 448,
      "2000": 449,
      "start": 450,
      "me": 451,
      "pt": 452,
      "CH4": 453,
      "be": 454,
      "buffer": 455,
      "dl": 456,
      "CH3": 457,
      "dly": 458,
      "ws": 459,
      "periodically": 460,
      "load": 461,
      "pb": 462,
      "badu": 463,
      "bytes": 464,
      "det": 465,
      "no": 466,
      "buad": 467,
      "ex": 468,
      "so": 469,
      "mes": 470,
      "ution": 471,
      "sage": 472,
      "detect": 473,
      "exec": 474,
      "vel": 475,
      "wor": 476,
      "atedly": 477,
      "value": 478,
      "repeatedly": 479,
      "work": 480,
      "hal": 481,
      "bli": 482,
      "halt": 483,
      "sof": 484,
      "execution": 485,
      "blish": 486,
      "message": 487,
      "soft": 488,
      "ca": 489,
      "ment": 490,
      "1000": 491,
      "imple": 492,
      "log": 493,
      "rity": 494,
      "ware": 495,
      "esta": 496,
      "prog": 497,
      "establish": 498,
      "rv": 499,
      "level": 500,
      "pture": 501,
      "software": 502,
      "implement": 503,
      "oper": 504,
      "parity": 505,
      "capture": 506,
      "rvery": 507,
      "pc": 508,
      "thrn": 509,
      "sense": 510,
      "nt": 511,
      "ta": 512,
      "ation": 513,
      "logic": 514,
      "push": 515,
      "ram": 516,
      "che": 517,
      "program": 518,
      "dur": 519,
      "slso": 520,
      "dury": 521,
      "check": 522,
      "ung": 523,
      "operation": 524,
      "list": 525,
      "coll": 526,
      "old": 527,
      "string": 528,
      "poll": 529,
      "cent": 530,
      "feed": 531,
      "rri": 532,
      "reading": 533,
      "collect": 534,
      "wi": 535,
      "modr": 536,
      "wsit": 537,
      "rriv": 538,
      "ste": 539,
      "output_open_dr": 540,
      "listen": 541,
      "hold": 542,
      "percent": 543,
      "rriving": 544,
      "fr": 545,
      "pd": 546,
      "sin": 547,
      "ae": 548,
      "ed": 549,
      "ov": 550,
      "rll": 551,
      "wrll": 552,
      "ac": 553,
      "stpp": 554,
      "output_open_drsin": 555,
      "lr": 556,
      "evr": 557,
      "arriving": 558,
      "gpiob": 559,
      "evry": 560,
      "if": 561,
      "800": 562,
      "but": 563,
      "ng": 564,
      "sd": 565,
      "over": 566,
      "buts": 567,
      "82": 568,
      "gist": 569,
      "nnel": 570,
      "ol": 571,
      "put_pull": 572,
      "gpioc": 573,
      "ey": 574,
      "kae": 575,
      "mkae": 576,
      "evey": 577,
      "unput_pull": 578,
      "gpiod": 579,
      "gpioa": 580,
      "sample": 581,
      "14": 582,
      "pm": 583,
      "ps": 584,
      "wsnt": 585,
      "gister": 586,
      "da": 587,
      "wih": 588,
      "0x": 589,
      "cur": 590,
      "dta": 591,
      "mon": 592,
      "ss": 593,
      "put_push_pull": 594,
      "register": 595,
      "bling": 596,
      "frpm": 597,
      "dtaa": 598,
      "mo": 599,
      "rr": 600,
      "vate": 601,
      "itor": 602,
      "usung": 603,
      "driv": 604,
      "monitor": 605,
      "ek": 606,
      "output_push": 607,
      "red": 608,
      "maek": 609,
      "potr": 610,
      "wti": 611,
      "enabling": 612,
      "92": 613,
      "snnel": 614,
      "putput_push_pull": 615,
      "open_drain": 616,
      "chsnnel": 617,
      "_open_drain": 618,
      "di": 619,
      "gpu": 620,
      "il": 621,
      "_drain": 622,
      "input_flo": 623,
      "tivate": 624,
      "daat": 625,
      "wiht": 626,
      "curre": 627,
      "wtih": 628,
      "gpuo": 629,
      "ne": 630,
      "prot": 631,
      "current": 632,
      "eevry": 633,
      "vol": 634,
      "sdditionally": 635,
      "psuse": 636,
      "10": 637,
      "wat": 638,
      "turm": 639,
      "tage": 640,
      "activate": 641,
      "1200": 642,
      "28": 643,
      "tu": 644,
      "what": 645,
      "unto": 646,
      "20": 647,
      "81": 648,
      "apb": 649,
      "hugh": 650,
      "ting": 651,
      "unput_pull_up": 652,
      "voltage": 653,
      "91": 654,
      "ph": 655,
      "uis": 656,
      "rey": 657,
      "evrey": 658,
      "thne": 659,
      "whilr": 660,
      "periph": 661,
      "driven": 662,
      "uisng": 663,
      "13": 664,
      "4800": 665,
      "PB": 666,
      "dtu": 667,
      "alos": 668,
      "form": 669,
      "additi": 670,
      "usrt": 671,
      "sting": 672,
      "stpo": 673,
      "stste": 674,
      "millis": 675,
      "flup": 676,
      "eveyr": 677,
      "unput_pull_down": 678,
      "moed": 679,
      "28800": 680,
      "dtuy": 681,
      "2500": 682,
      "PA": 683,
      "_floating": 684,
      "eery": 685,
      "hg": 686,
      "ible": 687,
      "ls": 688,
      "nred": 689,
      "add": 690,
      "thr": 691,
      "cess": 692,
      "cyclr": 693,
      "blok": 694,
      "oscillste": 695,
      "access": 696,
      "input_flosting": 697,
      "peripher": 698,
      "250000": 699,
      "accessible": 700,
      "_p": 701,
      "nig": 702,
      "rconds": 703,
      "ssh": 704,
      "outpt": 705,
      "_pul": 706,
      "setting": 707,
      "_upll": 708,
      "flssh": 709,
      "digitsl": 710,
      "turned": 711,
      "14400": 712,
      "wati": 713,
      "millisrconds": 714,
      "hn": 715,
      "su": 716,
      "ull": 717,
      "va": 718,
      "yt": 719,
      "inpu": 720,
      "aslo": 721,
      "pull": 722,
      "puld": 723,
      "_pull_up": 724,
      "shpuld": 725,
      "plsu": 726,
      "cyle": 727,
      "blockung": 728,
      "tehn": 729,
      "sot": 730,
      "wiat": 731,
      "frmo": 732,
      "0x400": 733,
      "addition": 734,
      "12": 735,
      "2400": 736,
      "br": 737,
      "ie": 738,
      "ot": 739,
      "sll": 740,
      "wn": 741,
      "inut": 742,
      "seconds": 743,
      "pugh": 744,
      "en_drain": 745,
      "usign": 746,
      "allow": 747,
      "output_op": 748,
      "bytr": 749,
      "duyt": 750,
      "thrpugh": 751,
      "blokc": 752,
      "peripheral": 753,
      "11": 754,
      "pck": 755,
      "rve": 756,
      "rste": 757,
      "uing": 758,
      "inpt": 759,
      "puls": 760,
      "aly": 761,
      "blpck": 762,
      "usnig": 763,
      "losd": 764,
      "whiel": 765,
      "chann": 766,
      "millisec": 767,
      "uncoming": 768,
      "ungate": 769,
      "lrvel": 770,
      "ilate": 771,
      "brig": 772,
      "wnat": 773,
      "inptu": 774,
      "_ull": 775,
      "im": 776,
      "oe": 777,
      "pn": 778,
      "wle": 779,
      "upt": 780,
      "stte": 781,
      "input_pull_d": 782,
      "timrr": 783,
      "buffrr": 784,
      "sssign": 785,
      "dirve": 786,
      "sotp": 787,
      "additionaly": 788,
      "wlel": 789,
      "18": 790,
      "_t": 791,
      "ase": 792,
      "bti": 793,
      "bist": 794,
      "bol": 795,
      "gate": 796,
      "hsl": 797,
      "ionally": 798,
      "la": 799,
      "lit": 800,
      "lie": 801,
      "mer": 802,
      "tmer": 803,
      "ul": 804,
      "ital": 805,
      "puase": 806,
      "_pull_down": 807,
      "itionally": 808,
      "aditionally": 809,
      "usng": 810,
      "sh_pull": 811,
      "output_p": 812,
      "output_open": 813,
      "plul": 814,
      "whlie": 815,
      "paue": 816,
      "whie": 817,
      "signsl": 818,
      "oscilate": 819,
      "rung": 820,
      "repeat": 821,
      "ovrr": 822,
      "output_push_upll": 823,
      "addit": 824,
      "channle": 825,
      "btis": 826,
      "bolck": 827,
      "hslt": 828,
      "brung": 829,
      "fred": 830,
      "hi": 831,
      "iseconds": 832,
      "king": 833,
      "sg": 834,
      "sor": 835,
      "trough": 836,
      "ut_open_drain": 837,
      "inot": 838,
      "output_pu": 839,
      "input_pul": 840,
      "blco": 841,
      "addi": 842,
      "usig": 843,
      "whle": 844,
      "fla": 845,
      "b12": 846,
      "ppll": 847,
      "pei": 848,
      "progr": 849,
      "ede": 850,
      "wihle": 851,
      "drivr": 852,
      "output_push_pul": 853,
      "watn": 854,
      "addti": 855,
      "vale": 856,
      "hihg": 857,
      "16": 858,
      "17": 859,
      "brn": 860,
      "b20": 861,
      "cr": 862,
      "ct": 863,
      "d_": 864,
      "dive": 865,
      "doe": 866,
      "est": 867,
      "fo": 868,
      "hlo": 869,
      "id": 870,
      "ih": 871,
      "lve": 872,
      "mr": 873,
      "mil": 874,
      "mdoe": 875,
      "nan": 876,
      "ough": 877,
      "p_ull": 878,
      "rod": 879,
      "sat": 880,
      "sit": 881,
      "sate": 882,
      "swut": 883,
      "srn": 884,
      "srriving": 885,
      "tun": 886,
      "uc": 887,
      "vsl": 888,
      "wpr": 889,
      "put_open_drain": 890,
      "outut_open_drain": 891,
      "input_upll": 892,
      "enl": 893,
      "upsh_pull": 894,
      "shu": 895,
      "loating": 896,
      "ods": 897,
      "output_upsh_pull": 898,
      "chnnel": 899,
      "chnan": 900,
      "output_open_da": 901,
      "chanel": 902,
      "chanenl": 903,
      "cycel": 904,
      "byt": 905,
      "byet": 906,
      "perid": 907,
      "time": 908,
      "timr": 909,
      "buf": 910,
      "oscillte": 911,
      "oscillae": 912,
      "spred": 913,
      "producr": 914,
      "a12": 915,
      "some": 916,
      "messs": 917,
      "loguc": 918,
      "tae": 919,
      "wile": 920,
      "hgih": 921,
      "outpt_open_drain": 922,
      "inpu_t": 923,
      "inut_floating": 924,
      "output_ope": 925,
      "impl": 926,
      "output_pen_drain": 927,
      "output_open_": 928,
      "peirod": 929,
      "hlod": 930,
      "lveel": 931,
      "satte": 932,
      "swutch": 933,
      "tunr": 934,
      "wprk": 935,
      "chnanel": 936,
      "messsge": 937,
      "04": 938,
      "2en": 939,
      "_h": 940,
      "aet": 941,
      "b2": 942,
      "bo": 943,
      "bt": 944,
      "cm": 945,
      "can": 946,
      "ccyle": 947,
      "d0": 948,
      "emr": 949,
      "hl": 950,
      "hs": 951,
      "h_pull": 952,
      "hpl": 953,
      "hnnel": 954,
      "iop": 955,
      "nut": 956,
      "oally": 957,
      "pas": 958,
      "rck": 959,
      "sould": 960,
      "sblish": 961,
      "s_h": 962,
      "ture": 963,
      "ule": 964,
      "u_p": 965,
      "vl": 966,
      "won": 967,
      "ye": 968,
      "inally": 969,
      "incom": 970,
      "itno": 971,
      "outpu": 972,
      "lly": 973,
      "assg": 974,
      "puse": 975,
      "blck": 976,
      "thro": 977,
      "riod": 978,
      "chck": 979,
      "chce": 980,
      "chrck": 981,
      "input_pull_pu": 982,
      "input_pullu_p": 983,
      "sensor": 984,
      "pase": 985,
      "trun": 986,
      "smple": 987,
      "millie": 988,
      "input_plul": 989,
      "tiemr": 990,
      "bsudrate": 991,
      "flsa": 992,
      "perod": 993,
      "urat": 994,
      "gpio_": 995,
      "digi": 996,
      "b17": 997,
      "runing": 998,
      "ipnut": 999,
      "a10": 1000,
      "ccle": 1001,
      "preps": 1002,
      "periodicsll": 1003,
      "wsre": 1004,
      "softwsre": 1005,
      "cahnnel": 1006,
      "implem": 1007,
      "operat": 1008,
      "listrn": 1009,
      "output_open_dran": 1010,
      "psrity": 1011,
      "currn": 1012,
      "drivrn": 1013,
      "diital": 1014,
      "ne_drain": 1015,
      "outpt_push_pull": 1016,
      "vaule": 1017,
      "output_opne_drain": 1018,
      "millisecn": 1019,
      "inptu_floating": 1020,
      "inptu_pull_up": 1021,
      "input_pull_dwon": 1022,
      "liten": 1023,
      "signsls": 1024,
      "output_pus_h": 1025,
      "input_pul_up": 1026,
      "blcok": 1027,
      "addtiionally": 1028,
      "estsblish": 1029,
      "foating": 1030,
      "shuold": 1031,
      "output_open_dain": 1032,
      "bock": 1033,
      "btye": 1034,
      "cming": 1035,
      "cannel": 1036,
      "hlat": 1037,
      "hpld": 1038,
      "pasue": 1039,
      "chcek": 1040,
      "input_plul_up": 1041,
      "flsah": 1042,
      "prepsre": 1043,
      "periodicslly": 1044,
      "output_pus_hpull": 1045,
      "08": 1046,
      "PC": 1047,
      "_plul": 1048,
      "ap": 1049,
      "ait": 1050,
      "bing": 1051,
      "ci": 1052,
      "csp": 1053,
      "cution": 1054,
      "ctivate": 1055,
      "dg": 1056,
      "dr": 1057,
      "dy": 1058,
      "drt": 1059,
      "esage": 1060,
      "efr": 1061,
      "fas": 1062,
      "fash": 1063,
      "fol": 1064,
      "fil": 1065,
      "gn": 1066,
      "gste": 1067,
      "hu": 1068,
      "hough": 1069,
      "iod": 1070,
      "lg": 1071,
      "lvel": 1072,
      "mll": 1073,
      "nd": 1074,
      "nre": 1075,
      "nede": 1076,
      "oc": 1077,
      "otu": 1078,
      "o_p": 1079,
      "oupt": 1080,
      "pll": 1081,
      "rment": 1082,
      "rcent": 1083,
      "rda": 1084,
      "sw": 1085,
      "srt": 1086,
      "sbling": 1087,
      "sie": 1088,
      "ssmple": 1089,
      "sctivate": 1090,
      "tch": 1091,
      "uo": 1092,
      "uat": 1093,
      "u_open_drain": 1094,
      "vali": 1095,
      "ut_push_pull": 1096,
      "ino": 1097,
      "inco": 1098,
      "incming": 1099,
      "itonally": 1100,
      "onds": 1101,
      "msesage": 1102,
      "sepe": 1103,
      "outupt": 1104,
      "outputo_p": 1105,
      "baudart": 1106,
      "leev": 1107,
      "inputp_ull": 1108,
      "igc": 1109,
      "ensbling": 1110,
      "usart": 1111,
      "loigc": 1112,
      "ope": 1113,
      "oprn": 1114,
      "stion": 1115,
      "stsll": 1116,
      "sttae": 1117,
      "output_oe": 1118,
      "input_pull_p": 1119,
      "illate": 1120,
      "trhough": 1121,
      "vie": 1122,
      "millsie": 1123,
      "input_ull": 1124,
      "input_loating": 1125,
      "input_fol": 1126,
      "input_pll": 1127,
      "unic": 1128,
      "stae": 1129,
      "staet": 1130,
      "tim3": 1131,
      "timre": 1132,
      "signas": 1133,
      "signal": 1134,
      "oscillaet": 1135,
      "prrcent": 1136,
      "sped": 1137,
      "b10": 1138,
      "b16": 1139,
      "b18": 1140,
      "a11": 1141,
      "a16": 1142,
      "a18": 1143,
      "runnung": 1144,
      "uart_": 1145,
      "preiod": 1146,
      "sapm": 1147,
      "rcc_": 1148,
      "a20": 1149,
      "pepare": 1150,
      "repeste": 1151,
      "mesage": 1152,
      "sohu": 1153,
      "operstion": 1154,
      "taing": 1155,
      "push_pull": 1156,
      "chek": 1157,
      "acti": 1158,
      "output_push_ull": 1159,
      "output_push_plul": 1160,
      "input_float": 1161,
      "input_flotaing": 1162,
      "volt": 1163,
      "additioally": 1164,
      "periphersl": 1165,
      "outptu_open_drain": 1166,
      "inpu_pull_up": 1167,
      "0x40000": 1168,
      "0x40010": 1169,
      "sllow": 1170,
      "inut_pull_down": 1171,
      "millisecods": 1172,
      "imng": 1173,
      "pn_drain": 1174,
      "input_pull_don": 1175,
      "laod": 1176,
      "litsen": 1177,
      "paues": 1178,
      "repeatel": 1179,
      "repeatdly": 1180,
      "addiionally": 1181,
      "addiitonally": 1182,
      "flahs": 1183,
      "progrma": 1184,
      "valeu": 1185,
      "brng": 1186,
      "miliseconds": 1187,
      "sitch": 1188,
      "srnse": 1189,
      "vslue": 1190,
      "input_upll_up": 1191,
      "bytse": 1192,
      "bufefr": 1193,
      "inpu_tfloating": 1194,
      "output_ope_drain": 1195,
      "implrment": 1196,
      "output_open_rda": 1197,
      "assgin": 1198,
      "millieconds": 1199,
      "currnet": 1200,
      "apb1": 1201,
      "cspture": 1202,
      "drvie": 1203,
      "drtect": 1204,
      "fast": 1205,
      "filp": 1206,
      "mlliseconds": 1207,
      "nreds": 1208,
      "uatr": 1209,
      "incoimng": 1210,
      "seped": 1211,
      "outputo_pen_drain": 1212,
      "baudarte": 1213,
      "leevl": 1214,
      "inputp_ull_up": 1215,
      "output_oepn_drain": 1216,
      "millsieconds": 1217,
      "input_folating": 1218,
      "unication": 1219,
      "sapmle": 1220,
      "repestedly": 1221,
      "sohuld": 1222,
      "output_open_rdain": 1223,
      "2800": 1224,
      "PD": 1225,
      "_own": 1226,
      "_loating": 1227,
      "_nd": 1228,
      "a8": 1229,
      "a9": 1230,
      "am": 1231,
      "arriv": 1232,
      "bf": 1233,
      "bud": 1234,
      "bff": 1235,
      "bil": 1236,
      "cat": 1237,
      "cing": 1238,
      "c15": 1239,
      "c13": 1240,
      "dee": 1241,
      "dte": 1242,
      "ea": 1243,
      "fs": 1244,
      "fer": 1245,
      "fware": 1246,
      "fede": 1247,
      "f_loating": 1248,
      "gu": 1249,
      "gsit": 1250,
      "hod": 1251,
      "kr": 1252,
      "las": 1253,
      "lal": 1254,
      "lce": 1255,
      "lpe": 1256,
      "lilate": 1257,
      "lfoating": 1258,
      "munication": 1259,
      "mlpe": 1260,
      "ns": 1261,
      "nate": 1262,
      "oi": 1263,
      "oud": 1264,
      "oic": 1265,
      "oting": 1266,
      "oid": 1267,
      "oinally": 1268,
      "okr": 1269,
      "pi": 1270,
      "priod": 1271,
      "sig": 1272,
      "swith": 1273,
      "sall": 1274,
      "sma": 1275,
      "swti": 1276,
      "sillate": 1277,
      "uhg": 1278,
      "uh_pull": 1279,
      "ufer": 1280,
      "vte": 1281,
      "wro": 1282,
      "wokr": 1283,
      "xcution": 1284,
      "int": 1285,
      "iner": 1286,
      "inupt": 1287,
      "atl": 1288,
      "iten": 1289,
      "itvate": 1290,
      "llate": 1291,
      "asign": 1292,
      "asis": 1293,
      "rea": 1294,
      "resd": 1295,
      "regist": 1296,
      "reda": 1297,
      "regsit": 1298,
      "udce": 1299,
      "baudra": 1300,
      "baudrt": 1301,
      "leel": 1302,
      "orugh": 1303,
      "inputpull": 1304,
      "inputf_loating": 1305,
      "alter": 1306,
      "enr": 1307,
      "anls": 1308,
      "blun": 1309,
      "adid": 1310,
      "blinking": 1311,
      "shoud": 1312,
      "thing": 1313,
      "though": 1314,
      "thorugh": 1315,
      "str": 1316,
      "stll": 1317,
      "strn": 1318,
      "stlal": 1319,
      "odns": 1320,
      "output_ps": 1321,
      "input_pull_own": 1322,
      "ceonds": 1323,
      "part": 1324,
      "eexcution": 1325,
      "cyce": 1326,
      "cylce": 1327,
      "millseconds": 1328,
      "blocing": 1329,
      "input_fla": 1330,
      "input_foating": 1331,
      "input_lfoating": 1332,
      "tion": 1333,
      "tier": 1334,
      "tionally": 1335,
      "flpi": 1336,
      "gpoi": 1337,
      "drie": 1338,
      "signlas": 1339,
      "ecution": 1340,
      "digitla": 1341,
      "osclilate": 1342,
      "prpare": 1343,
      "prdu": 1344,
      "prriod": 1345,
      "b11": 1346,
      "b13": 1347,
      "ically": 1348,
      "ouput_open_drain": 1349,
      "runnig": 1350,
      "runnign": 1351,
      "prepa": 1352,
      "prepre": 1353,
      "sablish": 1354,
      "samlpe": 1355,
      "communication": 1356,
      "rxecution": 1357,
      "neesd": 1358,
      "buffre": 1359,
      "intervsl": 1360,
      "intervl": 1361,
      "ister": 1362,
      "proudce": 1363,
      "detet": 1364,
      "execut": 1365,
      "exection": 1366,
      "softw": 1367,
      "logc": 1368,
      "collet": 1369,
      "acitvate": 1370,
      "1404": 1371,
      "0x2": 1372,
      "0x3": 1373,
      "rrgister": 1374,
      "output_pushpull": 1375,
      "output_pushp_ull": 1376,
      "ilseconds": 1377,
      "input_floait": 1378,
      "apb2en": 1379,
      "millisceonds": 1380,
      "lsiten": 1381,
      "thruo": 1382,
      "inpu_floating": 1383,
      "sotfware": 1384,
      "0x4001": 1385,
      "additionlly": 1386,
      "otput_push_pull": 1387,
      "inut_pull_up": 1388,
      "bytrs": 1389,
      "blokcing": 1390,
      "channl": 1391,
      "millisecodns": 1392,
      "additionalyl": 1393,
      "_tpush_pull": 1394,
      "output_psh_pull": 1395,
      "output_opend_": 1396,
      "additonally": 1397,
      "additinally": 1398,
      "additoinally": 1399,
      "blcoking": 1400,
      "progrsm": 1401,
      "addtionally": 1402,
      "brnig": 1403,
      "mililseconds": 1404,
      "srnsor": 1405,
      "input_upll_down": 1406,
      "byts": 1407,
      "byets": 1408,
      "perido": 1409,
      "bufer": 1410,
      "inpu_tpull": 1411,
      "output_ope_nd": 1412,
      "implment": 1413,
      "output_open_rain": 1414,
      "incomign": 1415,
      "incomng": 1416,
      "outpu_tpush_pull": 1417,
      "throgu": 1418,
      "throuhg": 1419,
      "truned": 1420,
      "digial": 1421,
      "digiatl": 1422,
      "ipnut_pull_up": 1423,
      "implemnt": 1424,
      "operatino": 1425,
      "millisecnds": 1426,
      "millisecnods": 1427,
      "080": 1428,
      "dgital": 1429,
      "lgoic": 1430,
      "ocsillate": 1431,
      "otuput_open_drain": 1432,
      "ouptut_push_pull": 1433,
      "swtch": 1434,
      "srtting": 1435,
      "valid_": 1436,
      "outupt_push_pull": 1437,
      "opeation": 1438,
      "input_ull_down": 1439,
      "input_pll_down": 1440,
      "tim3ms": 1441,
      "input_floatnig": 1442,
      "repeateldy": 1443,
      "apb1enr": 1444,
      "arrivign": 1445,
      "bfufer": 1446,
      "budrate": 1447,
      "bffer": 1448,
      "dtect": 1449,
      "fsst": 1450,
      "hodl": 1451,
      "siganls": 1452,
      "swithc": 1453,
      "smaple": 1454,
      "swtich": 1455,
      "wrok": 1456,
      "inerval": 1457,
      "asisgn": 1458,
      "resding": 1459,
      "registr": 1460,
      "redaing": 1461,
      "regsiter": 1462,
      "baudraet": 1463,
      "alternate": 1464,
      "blunking": 1465,
      "adidtionally": 1466,
      "shoudl": 1467,
      "strnig": 1468,
      "output_psuh_pull": 1469,
      "parti": 1470,
      "input_flaoting": 1471,
      "prduce": 1472,
      "14040": 1473,
      "input_floaitng": 1474,
      "apb2enr": 1475,
      "thruogh": 1476,
      "output_opend_rain": 1477,
      "output_ope_ndrain": 1478,
      "throguh": 1479,
      "0c": 1480,
      "0400": 1481,
      "1c": 1482,
      "1en": 1483,
      "1400": 1484,
      "21000": 1485,
      "3en": 1486,
      "4en": 1487,
      "4080": 1488,
      "80": 1489,
      "_top": 1490,
      "_ld": 1491,
      "af": 1492,
      "aen": 1493,
      "a15": 1494,
      "apre": 1495,
      "arri": 1496,
      "avte": 1497,
      "b3": 1498,
      "b4": 1499,
      "big": 1500,
      "ben": 1501,
      "b15": 1502,
      "c00": 1503,
      "cen": 1504,
      "cally": 1505,
      "cue": 1506,
      "cpture": 1507,
      "cnt": 1508,
      "c14": 1509,
      "d1": 1510,
      "den": 1511,
      "drate": 1512,
      "dou": 1513,
      "drve": 1514,
      "es": 1515,
      "eatedly": 1516,
      "esablish": 1517,
      "fre": 1518,
      "fal": 1519,
      "gip": 1520,
      "gae": 1521,
      "ht": 1522,
      "her": 1523,
      "iw": 1524,
      "iset": 1525,
      "icoming": 1526,
      "irn": 1527,
      "iac": 1528,
      "iput_pull": 1529,
      "iital": 1530,
      "iking": 1531,
      "lst": 1532,
      "laly": 1533,
      "liset": 1534,
      "met": 1535,
      "non": 1536,
      "ning": 1537,
      "nds": 1538,
      "net": 1539,
      "ned": 1540,
      "n_drain": 1541,
      "nking": 1542,
      "niking": 1543,
      "oin": 1544,
      "oen_drain": 1545,
      "ptr": 1546,
      "podu": 1547,
      "prity": 1548,
      "qu": 1549,
      "rl": 1550,
      "rin": 1551,
      "ror": 1552,
      "ral": 1553,
      "rge": 1554,
      "rrn": 1555,
      "rgister": 1556,
      "rct": 1557,
      "sing": 1558,
      "sro": 1559,
      "sconds": 1560,
      "sge": 1561,
      "sca": 1562,
      "siw": 1563,
      "tal": 1564,
      "tvate": 1565,
      "tct": 1566,
      "uit": 1567,
      "ugn": 1568,
      "vlo": 1569,
      "vot": 1570,
      "vla": 1571,
      "vtae": 1572,
      "wm": 1573,
      "wta": 1574,
      "utor": 1575,
      "000": 1576,
      "inal": 1577,
      "intr": 1578,
      "inoally": 1579,
      "invali": 1580,
      "atci": 1581,
      "ity": 1582,
      "ono": 1583,
      "sese": 1584,
      "seed": 1585,
      "outut_push_pull": 1586,
      "outputopen_drain": 1587,
      "outputpush_pull": 1588,
      "assin": 1589,
      "assing": 1590,
      "reig": 1591,
      "reister": 1592,
      "recnt": 1593,
      "reeatedly": 1594,
      "baur": 1595,
      "badrate": 1596,
      "TIM1": 1597,
      "ler": 1598,
      "levl": 1599,
      "inputfloating": 1600,
      "pure": 1601,
      "aling": 1602,
      "alow": 1603,
      "alol": 1604,
      "igtal": 1605,
      "error": 1606,
      "ency": 1607,
      "enaling": 1608,
      "cons": 1609,
      "blnig": 1610,
      "blniking": 1611,
      "elay": 1612,
      "ush_pull": 1613,
      "atedy": 1614,
      "blinkig": 1615,
      "shold": 1616,
      "shol": 1617,
      "_delay": 1618,
      "eval": 1619,
      "even": 1620,
      "dely": 1621,
      "5000": 1622,
      "loda": 1623,
      "stal": 1624,
      "ster": 1625,
      "strung": 1626,
      "stirn": 1627,
      "odd": 1628,
      "odcue": 1629,
      "riyt": 1630,
      "3800": 1631,
      "rae": 1632,
      "output_oen_drain": 1633,
      "output_ush_pull": 1634,
      "veform": 1635,
      "input_pullup": 1636,
      "input_pulld_": 1637,
      "cet": 1638,
      "ceck": 1639,
      "senos": 1640,
      "senes": 1641,
      "sensro": 1642,
      "when": 1643,
      "wae": 1644,
      "waht": 1645,
      "waveform": 1646,
      "paity": 1647,
      "pariyt": 1648,
      "trned": 1649,
      "milliseoc": 1650,
      "milliseonds": 1651,
      "millisecons": 1652,
      "blockign": 1653,
      "etsablish": 1654,
      "tial": 1655,
      "peroid": 1656,
      "crent": 1657,
      "unate": 1658,
      "driev": 1659,
      "perioid": 1660,
      "tim2en": 1661,
      "tim4en": 1662,
      "enabil": 1663,
      "enablnig": 1664,
      "periodci": 1665,
      "periodiac": 1666,
      "timer_p": 1667,
      "timer_delay": 1668,
      "digtial": 1669,
      "osic": 1670,
      "osillate": 1671,
      "digitl": 1672,
      "oscllate": 1673,
      "oscilltae": 1674,
      "prdou": 1675,
      "prodcue": 1676,
      "spede": 1677,
      "b14": 1678,
      "icth": 1679,
      "produe": 1680,
      "ipher": 1681,
      "ouput_push_pull": 1682,
      "a13": 1683,
      "a14": 1684,
      "a17": 1685,
      "artion": 1686,
      "runnng": 1687,
      "uart1": 1688,
      "uart2": 1689,
      "uart3": 1690,
      "preapre": 1691,
      "presca": 1692,
      "sae": 1693,
      "sable": 1694,
      "saple": 1695,
      "comple": 1696,
      "comunication": 1697,
      "perecnt": 1698,
      "pecrent": 1699,
      "peipher": 1700,
      "nees": 1701,
      "buffr": 1702,
      "intervla": 1703,
      "rnning": 1704,
      "periodiclly": 1705,
      "repeae": 1706,
      "repeaet": 1707,
      "repeatedy": 1708,
      "ptue": 1709,
      "befo": 1710,
      "detcet": 1711,
      "buadrate": 1712,
      "excution": 1713,
      "somr": 1714,
      "somet": 1715,
      "messg": 1716,
      "messae": 1717,
      "execuit": 1718,
      "word": 1719,
      "blih": 1720,
      "sofwta": 1721,
      "softwae": 1722,
      "captr": 1723,
      "captue": 1724,
      "logci": 1725,
      "establih": 1726,
      "progam": 1727,
      "rven": 1728,
      "operait": 1729,
      "listn": 1730,
      "collrct": 1731,
      "sinals": 1732,
      "actvate": 1733,
      "evral": 1734,
      "0x00": 1735,
      "0x38": 1736,
      "0x14": 1737,
      "0x10": 1738,
      "0x28": 1739,
      "0x20": 1740,
      "0x18": 1741,
      "0x04": 1742,
      "0x08": 1743,
      "0x0c": 1744,
      "0x1c": 1745,
      "currrn": 1746,
      "monutor": 1747,
      "output_push_p": 1748,
      "diigtal": 1749,
      "disable": 1750,
      "dirven": 1751,
      "curret": 1752,
      "neds": 1753,
      "1020": 1754,
      "28080": 1755,
      "2880": 1756,
      "205000": 1757,
      "apb2": 1758,
      "periphea": 1759,
      "periphral": 1760,
      "thrugh": 1761,
      "vaue": 1762,
      "inpu_pull_down": 1763,
      "sotware": 1764,
      "0x40004": 1765,
      "0x4000400": 1766,
      "0x40021000": 1767,
      "additionlaly": 1768,
      "brign": 1769,
      "otput_open_drain": 1770,
      "output_opn_drain": 1771,
      "inptu_pull_down": 1772,
      "input_pull_dwn": 1773,
      "lage": 1774,
      "repeatdely": 1775,
      "additinoally": 1776,
      "bolcking": 1777,
      "sginal": 1778,
      "output_puhs": 1779,
      "output_puh_pull": 1780,
      "input_pul_down": 1781,
      "input_pul_ld": 1782,
      "flah": 1783,
      "peiod": 1784,
      "progrm": 1785,
      "estblish": 1786,
      "idng": 1787,
      "shuld": 1788,
      "output_open_darin": 1789,
      "peridically": 1790,
      "something": 1791,
      "iopaen": 1792,
      "iopben": 1793,
      "iopcen": 1794,
      "iopden": 1795,
      "turend": 1796,
      "vltage": 1797,
      "outpu_open_drain": 1798,
      "outpu_top": 1799,
      "assgn": 1800,
      "milliesconds": 1801,
      "perodically": 1802,
      "gpio_output": 1803,
      "gpio_input": 1804,
      "gpio_toggle": 1805,
      "gpio_read": 1806,
      "ipnut_floating": 1807,
      "ipnut_pull_down": 1808,
      "implemet": 1809,
      "implemnet": 1810,
      "operatin": 1811,
      "operatoin": 1812,
      "output_open_drani": 1813,
      "currnt": 1814,
      "bocking": 1815,
      "btyes": 1816,
      "dgiital": 1817,
      "lgic": 1818,
      "otuput_push_pull": 1819,
      "ouptut_open_drain": 1820,
      "swicth": 1821,
      "srting": 1822,
      "uous": 1823,
      "inocming": 1824,
      "outupt_open_drain": 1825,
      "usart2en": 1826,
      "usart1en": 1827,
      "usart3en": 1828,
      "opeartion": 1829,
      "input_ull_up": 1830,
      "input_pll_up": 1831,
      "tim3en": 1832,
      "signasl": 1833,
      "uart_transmit": 1834,
      "uart_receive": 1835,
      "uart_init": 1836,
      "rcc_enable": 1837,
      "rcc_apb1enr": 1838,
      "rcc_apb2enr": 1839,
      "chekc": 1840,
      "activte": 1841,
      "actiavte": 1842,
      "activtae": 1843,
      "input_floatign": 1844,
      "voltge": 1845,
      "voltgae": 1846,
      "voltsge": 1847,
      "0x40000400": 1848,
      "0x40000800": 1849,
      "0x40000000": 1850,
      "0x40010400": 1851,
      "0x40010800": 1852,
      "0x40010c00": 1853,
      "input_pull_donw": 1854,
      "repeately": 1855,
      "ambig": 1856,
      "bilnking": 1857,
      "cature": 1858,
      "catpure": 1859,
      "deect": 1860,
      "deetct": 1861,
      "each": 1862,
      "inteval": 1863,
      "intevral": 1864,
      "inupt_floating": 1865,
      "inupt_pull_down": 1866,
      "reaing": 1867,
      "reaidng": 1868,
      "baudrte": 1869,
      "baudrtae": 1870,
      "inputpull_up": 1871,
      "inputpull_down": 1872,
      "strig": 1873,
      "strign": 1874,
      "prepae": 1875,
      "prepaer": 1876,
      "detetc": 1877,
      "executin": 1878,
      "executon": 1879,
      "softwre": 1880,
      "softwrae": 1881,
      "0x24": 1882,
      "0x2c": 1883,
      "0x34": 1884,
      "0x3c": 1885,
      "0x40011000": 1886,
      "0x40013800": 1887,
      "inpu_tpull_up": 1888,
      "inpu_tpull_down": 1889,
      "valid_parti": 1890,
      "valid_comple": 1891,
      "alternate_push_pull": 1892,
      "partiy": 1893,
      "after": 1894,
      "arriing": 1895,
      "frequ": 1896,
      "falsh": 1897,
      "gipo": 1898,
      "iput_pull_up": 1899,
      "lsten": 1900,
      "lisetn": 1901,
      "none": 1902,
      "poduce": 1903,
      "rgeister": 1904,
      "siwtch": 1905,
      "ugnate": 1906,
      "vlotage": 1907,
      "votlage": 1908,
      "intrval": 1909,
      "invalid": 1910,
      "atcivate": 1911,
      "reigster": 1912,
      "baurate": 1913,
      "alolw": 1914,
      "sholud": 1915,
      "stirng": 1916,
      "input_pulld_own": 1917,
      "senosr": 1918,
      "milliseocnds": 1919,
      "perioidcally": 1920,
      "enabilng": 1921,
      "periodcially": 1922,
      "periodiaclly": 1923,
      "timer_pwm": 1924,
      "osicllate": 1925,
      "prdouce": 1926,
      "prescaler": 1927,
      "peipheral": 1928,
      "repeaedly": 1929,
      "repeaetdly": 1930,
      "repeatedyl": 1931,
      "before": 1932,
      "somrthing": 1933,
      "someting": 1934,
      "messgae": 1935,
      "execuiton": 1936,
      "sofwtare": 1937,
      "captrue": 1938,
      "operaiton": 1939,
      "currrnt": 1940,
      "output_push_pll": 1941,
      "periphearl": 1942,
      "0x40004400": 1943,
      "0x40004000": 1944,
      "output_puhs_pull": 1945,
      "input_pul_ldown": 1946,
      "outpu_topen_drain": 1947,
      "ambiguous": 1948,
      "valid_partial": 1949,
      "valid_complete": 1950,
      "frequency": 1951
    },
