{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<SEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 143,
      "content": "PWM",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 162,
      "content": "200ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 168,
      "content": "500ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 170,
      "content": "2000ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 176,
      "content": "100ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 180,
      "content": "1000ms",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 192,
      "content": "output_push_pull",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 206,
      "content": "output_open_drain",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 220,
      "content": "2MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 228,
      "content": "50MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 235,
      "content": "10MHz",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 288,
      "content": "input_pull_up",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 293,
      "content": "input_floating",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 309,
      "content": "input_pull_down",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 386,
      "content": "CH1",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 415,
      "content": "CH3",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 417,
      "content": "CH4",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 423,
      "content": "CH2",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 663,
      "content": "PB",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 681,
      "content": "PA",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1045,
      "content": "PC",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1210,
      "content": "PD",
      "single_word": true,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1964,
      "content": "25%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1965,
      "content": "50%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1966,
      "content": "75%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1967,
      "content": "100%",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1968,
      "content": "GPIO_OUTPUT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1969,
      "content": "GPIO_INPUT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1970,
      "content": "GPIO_TOGGLE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1971,
      "content": "GPIO_READ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1972,
      "content": "UART_INIT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1973,
      "content": "UART_TRANSMIT",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1974,
      "content": "UART_RECEIVE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1975,
      "content": "TIMER_DELAY",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1976,
      "content": "TIMER_PWM",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1977,
      "content": "RCC_ENABLE",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1978,
      "content": "RCC_APB2ENR",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    },
    {
      "id": 1979,
      "content": "RCC_APB1ENR",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Whitespace"
      },
      {
        "type": "Split",
        "pattern": {
          "String": "([A-Z]{2})(\\d{1,2})"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          3
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<BOS>": 2,
      "<EOS>": 3,
      "<SEP>": 4,
      "%": 5,
      "-": 6,
      "/": 7,
      "0": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "4": 12,
      "5": 13,
      "6": 14,
      "7": 15,
      "8": 16,
      "9": 17,
      "A": 18,
      "B": 19,
      "C": 20,
      "D": 21,
      "E": 22,
      "F": 23,
      "G": 24,
      "H": 25,
      "I": 26,
      "J": 27,
      "K": 28,
      "L": 29,
      "M": 30,
      "N": 31,
      "O": 32,
      "P": 33,
      "Q": 34,
      "R": 35,
      "S": 36,
      "T": 37,
      "U": 38,
      "V": 39,
      "W": 40,
      "X": 41,
      "Y": 42,
      "Z": 43,
      "_": 44,
      "a": 45,
      "b": 46,
      "c": 47,
      "d": 48,
      "e": 49,
      "f": 50,
      "g": 51,
      "h": 52,
      "i": 53,
      "j": 54,
      "k": 55,
      "l": 56,
      "m": 57,
      "n": 58,
      "o": 59,
      "p": 60,
      "q": 61,
      "r": 62,
      "s": 63,
      "t": 64,
      "u": 65,
      "v": 66,
      "w": 67,
      "x": 68,
      "y": 69,
      "z": 70,
      "ut": 71,
      "00": 72,
      "in": 73,
      "put": 74,
      "at": 75,
      "it": 76,
      "AR": 77,
      "SAR": 78,
      "USAR": 79,
      "USART": 80,
      "on": 81,
      "se": 82,
      "ms": 83,
      "out": 84,
      "output": 85,
      "as": 86,
      "ll": 87,
      "200": 88,
      "re": 89,
      "ud": 90,
      "IM": 91,
      "TIM": 92,
      "ba": 93,
      "baud": 94,
      "or": 95,
      "input": 96,
      "le": 97,
      "al": 98,
      "to": 99,
      "pu": 100,
      "er": 101,
      "_pu": 102,
      "en": 103,
      "ig": 104,
      "an": 105,
      "set": 106,
      "con": 107,
      "USART2": 108,
      "100": 109,
      "USART3": 110,
      "USART1": 111,
      "for": 112,
      "ing": 113,
      "Hz": 114,
      "MHz": 115,
      "up": 116,
      "0ms": 117,
      "600": 118,
      "bl": 119,
      "pin": 120,
      "ure": 121,
      "el": 122,
      "fig": 123,
      "config": 124,
      "configure": 125,
      "_pull": 126,
      "iti": 127,
      "ate": 128,
      "ad": 129,
      "11": 130,
      "us": 131,
      "wit": 132,
      "ink": 133,
      "blink": 134,
      "0MHz": 135,
      "sh": 136,
      "_d": 137,
      "with": 138,
      "TIM2": 139,
      "st": 140,
      "ver": 141,
      "PW": 142,
      "PWM": 143,
      "TIM4": 144,
      "TIM3": 145,
      "od": 146,
      "ay": 147,
      "del": 148,
      "delay": 149,
      "bit": 150,
      "th": 151,
      "very": 152,
      "por": 153,
      "port": 154,
      "lo": 155,
      "500": 156,
      "setup": 157,
      "of": 158,
      "ri": 159,
      "every": 160,
      "op": 161,
      "200ms": 162,
      "ke": 163,
      "57": 164,
      "57600": 165,
      "5200": 166,
      "115200": 167,
      "500ms": 168,
      "400": 169,
      "2000ms": 170,
      "and": 171,
      "ali": 172,
      "ma": 173,
      "ze": 174,
      "initi": 175,
      "100ms": 176,
      "open": 177,
      "alize": 178,
      "initialize": 179,
      "1000ms": 180,
      "38": 181,
      "38400": 182,
      "_push": 183,
      "9600": 184,
      "all": 185,
      "make": 186,
      "_push_pull": 187,
      "ra": 188,
      "ve": 189,
      "19": 190,
      "19200": 191,
      "output_push_pull": 192,
      "output_": 193,
      "open_d": 194,
      "ally": 195,
      "ch": 196,
      "rain": 197,
      "output_open_d": 198,
      "als": 199,
      "wa": 200,
      "use": 201,
      "input_pull": 202,
      "ck": 203,
      "ell": 204,
      "well": 205,
      "output_open_drain": 206,
      "wh": 207,
      "then": 208,
      "add": 209,
      "onally": 210,
      "read": 211,
      "dat": 212,
      "data": 213,
      "ro": 214,
      "led": 215,
      "gg": 216,
      "togg": 217,
      "toggle": 218,
      "sen": 219,
      "2MHz": 220,
      "itionally": 221,
      "seri": 222,
      "serial": 223,
      "whi": 224,
      "ce": 225,
      "pl": 226,
      "also": 227,
      "50MHz": 228,
      "additionally": 229,
      "using": 230,
      "while": 231,
      "pa": 232,
      "10": 233,
      "plus": 234,
      "10MHz": 235,
      "wait": 236,
      "14": 237,
      "dut": 238,
      "duty": 239,
      "tr": 240,
      "send": 241,
      "13": 242,
      "ill": 243,
      "ed": 244,
      "12": 245,
      "15": 246,
      "rt": 247,
      "sm": 248,
      "top": 249,
      "stop": 250,
      "ansm": 251,
      "transm": 252,
      "transmit": 253,
      "ti": 254,
      "vi": 255,
      "CH": 256,
      "nel": 257,
      "per": 258,
      "via": 259,
      "chan": 260,
      "eed": 261,
      "cy": 262,
      "mod": 263,
      "ive": 264,
      "rece": 265,
      "receive": 266,
      "channel": 267,
      "iod": 268,
      "sta": 269,
      "flo": 270,
      "input_": 271,
      "cyc": 272,
      "_up": 273,
      "ating": 274,
      "et": 275,
      "mode": 276,
      "floating": 277,
      "75": 278,
      "period": 279,
      "25": 280,
      "cycle": 281,
      "un": 282,
      "ow": 283,
      "blo": 284,
      "50": 285,
      "own": 286,
      "mill": 287,
      "input_pull_up": 288,
      "milli": 289,
      "ds": 290,
      "block": 291,
      "_down": 292,
      "input_floating": 293,
      "bits": 294,
      "bs": 295,
      "bsud": 296,
      "fro": 297,
      "from": 298,
      "conds": 299,
      "millise": 300,
      "ur": 301,
      "wan": 302,
      "want": 303,
      "ena": 304,
      "fl": 305,
      "ble": 306,
      "gp": 307,
      "tim": 308,
      "input_pull_down": 309,
      "tx": 310,
      "milliseconds": 311,
      "off": 312,
      "enable": 313,
      "init": 314,
      "by": 315,
      "cre": 316,
      "create": 317,
      "dri": 318,
      "timer": 319,
      "io": 320,
      "get": 321,
      "gpio": 322,
      "ign": 323,
      "pause": 324,
      "te": 325,
      "co": 326,
      "dig": 327,
      "digit": 328,
      "state": 329,
      "sign": 330,
      "need": 331,
      "rate": 332,
      "gen": 333,
      "erate": 334,
      "generate": 335,
      "digital": 336,
      "start": 337,
      "ec": 338,
      "drive": 339,
      "tur": 340,
      "run": 341,
      "byte": 342,
      "rit": 343,
      "clo": 344,
      "clock": 345,
      "gh": 346,
      "turn": 347,
      "com": 348,
      "ld": 349,
      "ugh": 350,
      "bu": 351,
      "n1": 352,
      "ic": 353,
      "ion": 354,
      "os": 355,
      "low": 356,
      "sp": 357,
      "val": 358,
      "alt": 359,
      "n2": 360,
      "pp": 361,
      "thro": 362,
      "ip": 363,
      "ua": 364,
      "pr": 365,
      "ring": 366,
      "through": 367,
      "osc": 368,
      "speed": 369,
      "into": 370,
      "oscill": 371,
      "blocking": 372,
      "ash": 373,
      "ple": 374,
      "uce": 375,
      "be": 376,
      "writ": 377,
      "ent": 378,
      "flash": 379,
      "prod": 380,
      "write": 381,
      "hig": 382,
      "pre": 383,
      "high": 384,
      "ou": 385,
      "CH1": 386,
      "rx": 387,
      "sa": 388,
      "swit": 389,
      "runn": 390,
      "coming": 391,
      "ould": 392,
      "switch": 393,
      "flip": 394,
      "mple": 395,
      "oscillate": 396,
      "produce": 397,
      "ws": 398,
      "should": 399,
      "ue": 400,
      "ect": 401,
      "pprt": 402,
      "assign": 403,
      "pare": 404,
      "rc": 405,
      "incoming": 406,
      "is": 407,
      "prepare": 408,
      "running": 409,
      "bring": 410,
      "rcc": 411,
      "ge": 412,
      "wut": 413,
      "dsta": 414,
      "CH3": 415,
      "pro": 416,
      "CH4": 417,
      "ist": 418,
      "vel": 419,
      "wuth": 420,
      "rn": 421,
      "the": 422,
      "CH2": 423,
      "ac": 424,
      "ex": 425,
      "vate": 426,
      "uart": 427,
      "pt": 428,
      "buad": 429,
      "signals": 430,
      "exec": 431,
      "pe": 432,
      "es": 433,
      "value": 434,
      "du": 435,
      "level": 436,
      "tivate": 437,
      "9n1": 438,
      "pb": 439,
      "sl": 440,
      "mske": 441,
      "log": 442,
      "8n1": 443,
      "execut": 444,
      "9n2": 445,
      "halt": 446,
      "baudrate": 447,
      "bytes": 448,
      "det": 449,
      "ff": 450,
      "gin": 451,
      "ment": 452,
      "no": 453,
      "wor": 454,
      "prog": 455,
      "execution": 456,
      "imple": 457,
      "pul": 458,
      "ram": 459,
      "needs": 460,
      "work": 461,
      "ly": 462,
      "mes": 463,
      "nate": 464,
      "repe": 465,
      "1000": 466,
      "activate": 467,
      "ca": 468,
      "ernate": 469,
      "buff": 470,
      "alternate": 471,
      "logic": 472,
      "program": 473,
      "implement": 474,
      "8n2": 475,
      "pc": 476,
      "ter": 477,
      "ation": 478,
      "sage": 479,
      "detect": 480,
      "dly": 481,
      "inter": 482,
      "che": 483,
      "periodic": 484,
      "buffer": 485,
      "atedly": 486,
      "begin": 487,
      "repeatedly": 488,
      "check": 489,
      "badu": 490,
      "pulse": 491,
      "po": 492,
      "oper": 493,
      "message": 494,
      "interval": 495,
      "rll": 496,
      "wrll": 497,
      "rity": 498,
      "capt": 499,
      "ish": 500,
      "ung": 501,
      "operation": 502,
      "nt": 503,
      "capture": 504,
      "sq": 505,
      "stall": 506,
      "parity": 507,
      "periodically": 508,
      "so": 509,
      "blish": 510,
      "dur": 511,
      "esta": 512,
      "sof": 513,
      "ta": 514,
      "wi": 515,
      "sense": 516,
      "dury": 517,
      "establish": 518,
      "2000": 519,
      "wsit": 520,
      "squa": 521,
      "soft": 522,
      "load": 523,
      "wave": 524,
      "square": 525,
      "ev": 526,
      "ware": 527,
      "rvery": 528,
      "thrn": 529,
      "fr": 530,
      "software": 531,
      "list": 532,
      "comm": 533,
      "over": 534,
      "reading": 535,
      "wsnt": 536,
      "pd": 537,
      "cent": 538,
      "old": 539,
      "percent": 540,
      "ar": 541,
      "push": 542,
      "riv": 543,
      "coll": 544,
      "pm": 545,
      "reg": 546,
      "listen": 547,
      "lr": 548,
      "string": 549,
      "driv": 550,
      "sample": 551,
      "poll": 552,
      "wih": 553,
      "arriv": 554,
      "ste": 555,
      "slso": 556,
      "frpm": 557,
      "feed": 558,
      "hold": 559,
      "ister": 560,
      "arriving": 561,
      "ng": 562,
      "modr": 563,
      "collect": 564,
      "eve": 565,
      "register": 566,
      "evey": 567,
      "mon": 568,
      "usung": 569,
      "output_open_dr": 570,
      "put_pull": 571,
      "put_push_pull": 572,
      "stpp": 573,
      "gpioa": 574,
      "gpiob": 575,
      "ae": 576,
      "ol": 577,
      "monit": 578,
      "input_flo": 579,
      "gpiod": 580,
      "wiht": 581,
      "monitor": 582,
      "sd": 583,
      "unput_pull": 584,
      "800": 585,
      "sin": 586,
      "evr": 587,
      "0x": 588,
      "gpioc": 589,
      "da": 590,
      "putput_push_pull": 591,
      "evry": 592,
      "mo": 593,
      "nnel": 594,
      "vol": 595,
      "open_drain": 596,
      "daat": 597,
      "a1": 598,
      "ek": 599,
      "ps": 600,
      "maek": 601,
      "driven": 602,
      "output_open_drsin": 603,
      "_open_drain": 604,
      "if": 605,
      "kae": 606,
      "mkae": 607,
      "wti": 608,
      "_drain": 609,
      "wtih": 610,
      "wat": 611,
      "tage": 612,
      "voltage": 613,
      "82": 614,
      "apb": 615,
      "but": 616,
      "sting": 617,
      "prot": 618,
      "buts": 619,
      "what": 620,
      "bytr": 621,
      "ditionally": 622,
      "dta": 623,
      "ne": 624,
      "su": 625,
      "snnel": 626,
      "tu": 627,
      "yt": 628,
      "form": 629,
      "bling": 630,
      "chsnnel": 631,
      "plsu": 632,
      "turm": 633,
      "input_flosting": 634,
      "sdditionally": 635,
      "dtaa": 636,
      "91": 637,
      "cur": 638,
      "il": 639,
      "rr": 640,
      "ss": 641,
      "uis": 642,
      "red": 643,
      "additi": 644,
      "uisng": 645,
      "1200": 646,
      "sr": 647,
      "cyle": 648,
      "potr": 649,
      "20": 650,
      "_floating": 651,
      "oe": 652,
      "ting": 653,
      "rey": 654,
      "aly": 655,
      "_pull_up": 656,
      "cyclr": 657,
      "unto": 658,
      "digitsl": 659,
      "duyt": 660,
      "evrey": 661,
      "28": 662,
      "PB": 663,
      "dtu": 664,
      "gi": 665,
      "gpu": 666,
      "her": 667,
      "enabling": 668,
      "timrr": 669,
      "ipher": 670,
      "eveyr": 671,
      "unput_pull_up": 672,
      "unput_pull_down": 673,
      "psuse": 674,
      "wati": 675,
      "addition": 676,
      "dtuy": 677,
      "gpuo": 678,
      "2400": 679,
      "92": 680,
      "PA": 681,
      "dr": 682,
      "eevry": 683,
      "nig": 684,
      "rste": 685,
      "outpu": 686,
      "usrt": 687,
      "stste": 688,
      "output_op": 689,
      "whilr": 690,
      "14400": 691,
      "blok": 692,
      "millisr": 693,
      "curre": 694,
      "millisrconds": 695,
      "2500": 696,
      "b1": 697,
      "br": 698,
      "di": 699,
      "tm": 700,
      "ital": 701,
      "output_push": 702,
      "peripher": 703,
      "flup": 704,
      "turned": 705,
      "frmo": 706,
      "28800": 707,
      "current": 708,
      "250000": 709,
      "4800": 710,
      "a11": 711,
      "ccyle": 712,
      "hugh": 713,
      "sat": 714,
      "sll": 715,
      "outpt": 716,
      "upt": 717,
      "thr": 718,
      "riod": 719,
      "chann": 720,
      "millisec": 721,
      "tae": 722,
      "0x400": 723,
      "doe": 724,
      "eer": 725,
      "hn": 726,
      "mdoe": 727,
      "nut": 728,
      "nred": 729,
      "inpt": 730,
      "en_drain": 731,
      "setting": 732,
      "usnig": 733,
      "blockung": 734,
      "tehn": 735,
      "rung": 736,
      "ipnut": 737,
      "rng": 738,
      "sot": 739,
      "peripheral": 740,
      "eery": 741,
      "ase": 742,
      "b0": 743,
      "ctivate": 744,
      "hsl": 745,
      "ie": 746,
      "ssh": 747,
      "sctivate": 748,
      "uc": 749,
      "vsl": 750,
      "inpu": 751,
      "inally": 752,
      "lel": 753,
      "alos": 754,
      "puase": 755,
      "_pul": 756,
      "allow": 757,
      "whle": 758,
      "addit": 759,
      "paue": 760,
      "ede": 761,
      "tionally": 762,
      "vie": 763,
      "chanel": 764,
      "fla": 765,
      "flssh": 766,
      "wiat": 767,
      "lrvel": 768,
      "moed": 769,
      "additionaly": 770,
      "drvie": 771,
      "sotp": 772,
      "hslt": 773,
      "a10": 774,
      "bt": 775,
      "c14": 776,
      "d0": 777,
      "dgi": 778,
      "gate": 779,
      "hl": 780,
      "id": 781,
      "lie": 782,
      "nat": 783,
      "ot": 784,
      "pn": 785,
      "pck": 786,
      "ull": 787,
      "vl": 788,
      "wlel": 789,
      "wnat": 790,
      "inut": 791,
      "output_pu": 792,
      "blpck": 793,
      "_pull_down": 794,
      "usng": 795,
      "sttae": 796,
      "whlie": 797,
      "addi": 798,
      "whiel": 799,
      "trun": 800,
      "oscillste": 801,
      "runnung": 802,
      "puls": 803,
      "ungate": 804,
      "drivr": 805,
      "wihle": 806,
      "blokc": 807,
      "satte": 808,
      "flah": 809,
      "bty": 810,
      "dgiital": 811,
      "18": 812,
      "_p": 813,
      "a7": 814,
      "b2": 815,
      "b5": 816,
      "b8": 817,
      "bing": 818,
      "b10": 819,
      "b13": 820,
      "c15": 821,
      "d_": 822,
      "fo": 823,
      "ionally": 824,
      "ible": 825,
      "rve": 826,
      "uing": 827,
      "put_open_drain": 828,
      "pugh": 829,
      "usig": 830,
      "stte": 831,
      "thne": 832,
      "oprn": 833,
      "cess": 834,
      "cycel": 835,
      "uncoming": 836,
      "bsudrate": 837,
      "access": 838,
      "wile": 839,
      "listrn": 840,
      "watn": 841,
      "bytrs": 842,
      "dirve": 843,
      "thrpugh": 844,
      "channle": 845,
      "vslue": 846,
      "additinally": 847,
      "paues": 848,
      "accessible": 849,
      "16": 850,
      "81": 851,
      "a0": 852,
      "a4": 853,
      "a5": 854,
      "a6": 855,
      "b9": 856,
      "bist": 857,
      "brng": 858,
      "fred": 859,
      "gn": 860,
      "h_pull": 861,
      "hgi": 862,
      "im": 863,
      "nds": 864,
      "p_": 865,
      "priod": 866,
      "sate": 867,
      "swut": 868,
      "incom": 869,
      "seconds": 870,
      "aslo": 871,
      "input_pul": 872,
      "puld": 873,
      "shpuld": 874,
      "ods": 875,
      "losd": 876,
      "output_p": 877,
      "addtionally": 878,
      "whie": 879,
      "staet": 880,
      "byet": 881,
      "driev": 882,
      "wsve": 883,
      "som": 884,
      "output_open_dran": 885,
      "ilate": 886,
      "outpu_push_pull": 887,
      "output_ope": 888,
      "tmer": 889,
      "inptu": 890,
      "addiionally": 891,
      "btye": 892,
      "foating": 893,
      "hgih": 894,
      "swutch": 895,
      "17": 896,
      "_t": 897,
      "_top": 898,
      "a8": 899,
      "art": 900,
      "b12": 901,
      "bol": 902,
      "brung": 903,
      "can": 904,
      "em": 905,
      "fas": 906,
      "hnnel": 907,
      "ier": 908,
      "king": 909,
      "mil": 910,
      "nan": 911,
      "oc": 912,
      "rck": 913,
      "ssm": 914,
      "ture": 915,
      "ul": 916,
      "wpr": 917,
      "ut_open_drain": 918,
      "iten": 919,
      "outupt": 920,
      "outut_open_drain": 921,
      "ll_down": 922,
      "puse": 923,
      "blco": 924,
      "usign": 925,
      "sh_pull": 926,
      "stpo": 927,
      "strung": 928,
      "chnan": 929,
      "chrck": 930,
      "input_pull_d": 931,
      "plul": 932,
      "tier": 933,
      "signsl": 934,
      "prriod": 935,
      "preps": 936,
      "acti": 937,
      "loguc": 938,
      "messs": 939,
      "cahnnel": 940,
      "periodicsll": 941,
      "input_float": 942,
      "a18": 943,
      "sssign": 944,
      "outpu_top": 945,
      "brig": 946,
      "tmier": 947,
      "ipnut_pull_down": 948,
      "inpu_t": 949,
      "output_pus": 950,
      "flahs": 951,
      "inptu_floating": 952,
      "bolck": 953,
      "cannel": 954,
      "fast": 955,
      "ssmple": 956,
      "wprk": 957,
      "chnanel": 958,
      "signsls": 959,
      "prepsre": 960,
      "messsge": 961,
      "periodicslly": 962,
      "outpu_topen_drain": 963,
      "2en": 964,
      "a3": 965,
      "aue": 966,
      "b7": 967,
      "b11": 968,
      "b14": 969,
      "bti": 970,
      "b20": 971,
      "ct": 972,
      "csp": 973,
      "duce": 974,
      "fer": 975,
      "fash": 976,
      "fil": 977,
      "gip": 978,
      "hpl": 979,
      "iop": 980,
      "iseconds": 981,
      "laly": 982,
      "lfoating": 983,
      "nd": 984,
      "nre": 985,
      "ned": 986,
      "nede": 987,
      "otu": 988,
      "sw": 989,
      "sgin": 990,
      "tun": 991,
      "uat": 992,
      "vte": 993,
      "wro": 994,
      "inupt": 995,
      "orugh": 996,
      "blck": 997,
      "stsll": 998,
      "thorugh": 999,
      "loating": 1000,
      "input_pulld_": 1001,
      "cet": 1002,
      "tion": 1003,
      "cyce": 1004,
      "input_lfoating": 1005,
      "millisecon": 1006,
      "urat": 1007,
      "gpio_": 1008,
      "signal": 1009,
      "ically": 1010,
      "ication": 1011,
      "ppll": 1012,
      "oscilate": 1013,
      "preiod": 1014,
      "logc": 1015,
      "drivrn": 1016,
      "ne_drain": 1017,
      "oepn": 1018,
      "additionlaly": 1019,
      "output_opne_drain": 1020,
      "brign": 1021,
      "outpt_push_pull": 1022,
      "outpt_open_drain": 1023,
      "channl": 1024,
      "millisecods": 1025,
      "hlat": 1026,
      "hlod": 1027,
      "otput_open_drain": 1028,
      "inut_floating": 1029,
      "impl": 1030,
      "p_ull": 1031,
      "output_psh_pull": 1032,
      "miliseconds": 1033,
      "btis": 1034,
      "cspture": 1035,
      "filp": 1036,
      "gipo": 1037,
      "hpld": 1038,
      "nreds": 1039,
      "uatr": 1040,
      "wrok": 1041,
      "inupt_pull_up": 1042,
      "input_pulld_own": 1043,
      "1en": 1044,
      "PC": 1045,
      "_nd": 1046,
      "a9": 1047,
      "are": 1048,
      "a12": 1049,
      "aet": 1050,
      "b6": 1051,
      "b15": 1052,
      "cat": 1053,
      "c13": 1054,
      "cmo": 1055,
      "econds": 1056,
      "fs": 1057,
      "fede": 1058,
      "gram": 1059,
      "hg": 1060,
      "ir": 1061,
      "ivate": 1062,
      "iput_pull": 1063,
      "irng": 1064,
      "ls": 1065,
      "lod": 1066,
      "lce": 1067,
      "lvel": 1068,
      "liten": 1069,
      "ming": 1070,
      "n_drain": 1071,
      "ough": 1072,
      "pi": 1073,
      "pod": 1074,
      "rrn": 1075,
      "rment": 1076,
      "sor": 1077,
      "swith": 1078,
      "sould": 1079,
      "srn": 1080,
      "sbling": 1081,
      "tro": 1082,
      "uld": 1083,
      "vali": 1084,
      "won": 1085,
      "ution": 1086,
      "inte": 1087,
      "inco": 1088,
      "iter": 1089,
      "itno": 1090,
      "onds": 1091,
      "ll_up": 1092,
      "pull": 1093,
      "pure": 1094,
      "enl": 1095,
      "ensbling": 1096,
      "aditionally": 1097,
      "adid": 1098,
      "usre": 1099,
      "usart": 1100,
      "blinking": 1101,
      "shold": 1102,
      "stll": 1103,
      "stal": 1104,
      "thing": 1105,
      "riyt": 1106,
      "opne": 1107,
      "chck": 1108,
      "input_pullup": 1109,
      "sensor": 1110,
      "pariyt": 1111,
      "edly": 1112,
      "rtae": 1113,
      "tiem": 1114,
      "chanenl": 1115,
      "cylce": 1116,
      "input_p": 1117,
      "input_up": 1118,
      "input_ull": 1119,
      "input_plul": 1120,
      "input_loating": 1121,
      "millieconds": 1122,
      "milliseoc": 1123,
      "flpi": 1124,
      "time": 1125,
      "timr": 1126,
      "runing": 1127,
      "bufer": 1128,
      "icth": 1129,
      "sped": 1130,
      "throgh": 1131,
      "prduce": 1132,
      "oscillae": 1133,
      "produc": 1134,
      "wsre": 1135,
      "rct": 1136,
      "rcc_": 1137,
      "rnig": 1138,
      "uart_": 1139,
      "execu": 1140,
      "peir": 1141,
      "executin": 1142,
      "detcet": 1143,
      "progr": 1144,
      "implem": 1145,
      "squsre": 1146,
      "softwsre": 1147,
      "commun": 1148,
      "collrct": 1149,
      "output_open_drin": 1150,
      "0x0": 1151,
      "volt": 1152,
      "a16": 1153,
      "psrity": 1154,
      "currrn": 1155,
      "additio": 1156,
      "drve": 1157,
      "output_opn_drain": 1158,
      "b16": 1159,
      "b17": 1160,
      "b18": 1161,
      "brgin": 1162,
      "diital": 1163,
      "output_push_": 1164,
      "output_push_pul": 1165,
      "output_pushp_ull": 1166,
      "outptu": 1167,
      "thrugh": 1168,
      "millisecnds": 1169,
      "0x40000": 1170,
      "0x40010": 1171,
      "ipnut_pull_up": 1172,
      "inpu_pull_up": 1173,
      "vlue": 1174,
      "inut_pull_up": 1175,
      "output_puh_pull": 1176,
      "incomig": 1177,
      "input_pul_up": 1178,
      "byets": 1179,
      "some": 1180,
      "somr": 1181,
      "output_open_drani": 1182,
      "output_ope_drain": 1183,
      "output_ope_nd": 1184,
      "outupt_push_pull": 1185,
      "blcok": 1186,
      "input_pull_dwon": 1187,
      "inpu_tfloating": 1188,
      "output_pus_pull": 1189,
      "neds": 1190,
      "swicth": 1191,
      "tunr": 1192,
      "milliseconsd": 1193,
      "implrment": 1194,
      "fsst": 1195,
      "loda": 1196,
      "poduce": 1197,
      "srnse": 1198,
      "trough": 1199,
      "adidtionally": 1200,
      "input_plul_up": 1201,
      "milliseocnds": 1202,
      "producr": 1203,
      "peirod": 1204,
      "currrnt": 1205,
      "output_ope_ndrain": 1206,
      "2800": 1207,
      "3en": 1208,
      "40": 1209,
      "PD": 1210,
      "_h": 1211,
      "a2": 1212,
      "am": 1213,
      "ale": 1214,
      "aing": 1215,
      "a20": 1216,
      "avte": 1217,
      "bff": 1218,
      "bish": 1219,
      "cc": 1220,
      "cp": 1221,
      "cpm": 1222,
      "cming": 1223,
      "d1": 1224,
      "drt": 1225,
      "dive": 1226,
      "esage": 1227,
      "gste": 1228,
      "hi": 1229,
      "ht": 1230,
      "hck": 1231,
      "hough": 1232,
      "huld": 1233,
      "iput": 1234,
      "iat": 1235,
      "iking": 1236,
      "kr": 1237,
      "lg": 1238,
      "lilate": 1239,
      "mesage": 1240,
      "ns": 1241,
      "nods": 1242,
      "oi": 1243,
      "ov": 1244,
      "oud": 1245,
      "oevr": 1246,
      "oupt": 1247,
      "oinally": 1248,
      "oid": 1249,
      "o_p": 1250,
      "okr": 1251,
      "pas": 1252,
      "ral": 1253,
      "rig": 1254,
      "sma": 1255,
      "sce": 1256,
      "swi": 1257,
      "sne": 1258,
      "sgn": 1259,
      "tch": 1260,
      "uo": 1261,
      "uold": 1262,
      "u_p": 1263,
      "uication": 1264,
      "vaue": 1265,
      "vale": 1266,
      "vral": 1267,
      "wre": 1268,
      "wokr": 1269,
      "utor": 1270,
      "ut_push_pull": 1271,
      "inot": 1272,
      "incming": 1273,
      "ature": 1274,
      "iton": 1275,
      "itonally": 1276,
      "itvate": 1277,
      "mssage": 1278,
      "outputopen_drain": 1279,
      "outputp_": 1280,
      "outputo_p": 1281,
      "asign": 1282,
      "asis": 1283,
      "assin": 1284,
      "assgin": 1285,
      "assgn": 1286,
      "lly": 1287,
      "baudart": 1288,
      "les": 1289,
      "levl": 1290,
      "pull_down": 1291,
      "pules": 1292,
      "ush_pull": 1293,
      "shoud": 1294,
      "shuold": 1295,
      "stirng": 1296,
      "stedly": 1297,
      "strnig": 1298,
      "strig": 1299,
      "odns": 1300,
      "allw": 1301,
      "raet": 1302,
      "output_open": 1303,
      "output_oepn": 1304,
      "waht": 1305,
      "input_pull_pu": 1306,
      "input_pullu_p": 1307,
      "sene": 1308,
      "senes": 1309,
      "cehck": 1310,
      "pae": 1311,
      "pase": 1312,
      "part": 1313,
      "trhough": 1314,
      "perod": 1315,
      "perid": 1316,
      "peroid": 1317,
      "stae": 1318,
      "input_foating": 1319,
      "etc": 1320,
      "millisce": 1321,
      "blockign": 1322,
      "gpoi": 1323,
      "tim4": 1324,
      "timre": 1325,
      "byt": 1326,
      "byes": 1327,
      "digiat": 1328,
      "digitl": 1329,
      "ecution": 1330,
      "spede": 1331,
      "prrc": 1332,
      "prpe": 1333,
      "osclilate": 1334,
      "oscillte": 1335,
      "oscilltae": 1336,
      "oscillaet": 1337,
      "begn": 1338,
      "prodce": 1339,
      "prepae": 1340,
      "ouput_push_pull": 1341,
      "sae": 1342,
      "runnng": 1343,
      "act": 1344,
      "acitvate": 1345,
      "exection": 1346,
      "pepare": 1347,
      "peipher": 1348,
      "esd": 1349,
      "detct": 1350,
      "detetc": 1351,
      "messae": 1352,
      "repeat": 1353,
      "repestedly": 1354,
      "buffrr": 1355,
      "intervsl": 1356,
      "chek": 1357,
      "periodicaly": 1358,
      "pogram": 1359,
      "soem": 1360,
      "sohuld": 1361,
      "taing": 1362,
      "listn": 1363,
      "riving": 1364,
      "regiter": 1365,
      "drivn": 1366,
      "monutor": 1367,
      "input_floting": 1368,
      "input_flotaing": 1369,
      "sinals": 1370,
      "0x2": 1371,
      "0x3": 1372,
      "a17": 1373,
      "apb2en": 1374,
      "apb1en": 1375,
      "neesd": 1376,
      "srriving": 1377,
      "2040": 1378,
      "outpu_open_drain": 1379,
      "bloking": 1380,
      "output_push_p": 1381,
      "periphersl": 1382,
      "satll": 1383,
      "sllow": 1384,
      "millisecnods": 1385,
      "millisecodns": 1386,
      "0x4000": 1387,
      "0x4001": 1388,
      "inpt_pull_up": 1389,
      "ipnut_floating": 1390,
      "additoinally": 1391,
      "otput_push_pull": 1392,
      "vlaue": 1393,
      "addiitonally": 1394,
      "truned": 1395,
      "btyes": 1396,
      "imng": 1397,
      "incomng": 1398,
      "input_pul_down": 1399,
      "output_pen_drain": 1400,
      "outupt_open_drain": 1401,
      "blcoking": 1402,
      "input_pull_don": 1403,
      "activte": 1404,
      "actiavte": 1405,
      "input_floatign": 1406,
      "inpu_tpull_down": 1407,
      "output_pus_h": 1408,
      "otuput_push_pull": 1409,
      "otuput_open_drain": 1410,
      "logci": 1411,
      "catpure": 1412,
      "cmom": 1413,
      "iput_pull_down": 1414,
      "lsiten": 1415,
      "swithc": 1416,
      "valid_": 1417,
      "intevral": 1418,
      "incoimng": 1419,
      "tiemr": 1420,
      "input_pll_down": 1421,
      "input_upll_up": 1422,
      "input_ull_up": 1423,
      "execuiton": 1424,
      "executino": 1425,
      "progrsm": 1426,
      "communication": 1427,
      "additioally": 1428,
      "output_push_plul": 1429,
      "outptu_open_drain": 1430,
      "bffer": 1431,
      "ccle": 1432,
      "cpature": 1433,
      "cpmm": 1434,
      "drtect": 1435,
      "hihg": 1436,
      "iput_floating": 1437,
      "ouptut_push_pull": 1438,
      "pasue": 1439,
      "smaple": 1440,
      "swich": 1441,
      "valeu": 1442,
      "outputp_ush_pull": 1443,
      "outputo_pen_drain": 1444,
      "asisgn": 1445,
      "baudarte": 1446,
      "shoudl": 1447,
      "output_oepn_drain": 1448,
      "parti": 1449,
      "millisceonds": 1450,
      "digiatl": 1451,
      "prrcent": 1452,
      "prpeare": 1453,
      "peipheral": 1454,
      "apb2enr": 1455,
      "apb1enr": 1456,
      "output_push_pll": 1457,
      "output_pus_hpull": 1458,
      "08": 1459,
      "1c": 1460,
      "21000": 1461,
      "3ms": 1462,
      "4400": 1463,
      "7ms": 1464,
      "8ms": 1465,
      "_r": 1466,
      "_own": 1467,
      "_ld": 1468,
      "_loating": 1469,
      "af": 1470,
      "ain": 1471,
      "ait": 1472,
      "aen": 1473,
      "ach": 1474,
      "a14": 1475,
      "a13": 1476,
      "a15": 1477,
      "ablish": 1478,
      "aedly": 1479,
      "b3": 1480,
      "bf": 1481,
      "bo": 1482,
      "bud": 1483,
      "ben": 1484,
      "big": 1485,
      "birng": 1486,
      "brnig": 1487,
      "cr": 1488,
      "c00": 1489,
      "cen": 1490,
      "cally": 1491,
      "cpt": 1492,
      "civate": 1493,
      "cution": 1494,
      "de": 1495,
      "dg": 1496,
      "do": 1497,
      "den": 1498,
      "dte": 1499,
      "drate": 1500,
      "est": 1501,
      "etr": 1502,
      "esa": 1503,
      "eex": 1504,
      "eation": 1505,
      "eatedly": 1506,
      "euc": 1507,
      "estal": 1508,
      "eecution": 1509,
      "each": 1510,
      "fre": 1511,
      "fal": 1512,
      "fsat": 1513,
      "f_loating": 1514,
      "gu": 1515,
      "gnate": 1516,
      "gister": 1517,
      "gae": 1518,
      "gaet": 1519,
      "hod": 1520,
      "iw": 1521,
      "iset": 1522,
      "iper": 1523,
      "lit": 1524,
      "las": 1525,
      "lve": 1526,
      "lish": 1527,
      "mp": 1528,
      "mse": 1529,
      "non": 1530,
      "ning": 1531,
      "net": 1532,
      "noff": 1533,
      "nes": 1534,
      "niking": 1535,
      "nuication": 1536,
      "oin": 1537,
      "oic": 1538,
      "oting": 1539,
      "ped": 1540,
      "qu": 1541,
      "ror": 1542,
      "rge": 1543,
      "rpe": 1544,
      "rgister": 1545,
      "sit": 1546,
      "sig": 1547,
      "sall": 1548,
      "sill": 1549,
      "srt": 1550,
      "sge": 1551,
      "sca": 1552,
      "siter": 1553,
      "siw": 1554,
      "snes": 1555,
      "tal": 1556,
      "uer": 1557,
      "uec": 1558,
      "uion": 1559,
      "ugate": 1560,
      "uh_pull": 1561,
      "ufer": 1562,
      "uhg": 1563,
      "ugnate": 1564,
      "vle": 1565,
      "ven": 1566,
      "vtae": 1567,
      "wm": 1568,
      "000": 1569,
      "inng": 1570,
      "inoc": 1571,
      "incmo": 1572,
      "invali": 1573,
      "inetr": 1574,
      "ativate": 1575,
      "atcivate": 1576,
      "ono": 1577,
      "seed": 1578,
      "sesne": 1579,
      "seped": 1580,
      "outputpush": 1581,
      "asl": 1582,
      "llate": 1583,
      "reig": 1584,
      "reation": 1585,
      "resd": 1586,
      "reaing": 1587,
      "TIM1": 1588,
      "badrate": 1589,
      "balish": 1590,
      "baudate": 1591,
      "baudraet": 1592,
      "oram": 1593,
      "inputp_ull": 1594,
      "inputf_loating": 1595,
      "ler": 1596,
      "leel": 1597,
      "leev": 1598,
      "levle": 1599,
      "aling": 1600,
      "alte": 1601,
      "error": 1602,
      "ency": 1603,
      "enbling": 1604,
      "enaling": 1605,
      "igtal": 1606,
      "anlly": 1607,
      "upsh_pull": 1608,
      "blun": 1609,
      "bliking": 1610,
      "blniking": 1611,
      "urent": 1612,
      "elay": 1613,
      "blinkig": 1614,
      "blinkign": 1615,
      "blinknig": 1616,
      "shol": 1617,
      "shuld": 1618,
      "_delay": 1619,
      "ster": 1620,
      "stion": 1621,
      "stting": 1622,
      "strng": 1623,
      "odd": 1624,
      "dely": 1625,
      "though": 1626,
      "porduce": 1627,
      "porgram": 1628,
      "loic": 1629,
      "rian": 1630,
      "opeation": 1631,
      "opreation": 1632,
      "4000": 1633,
      "3800": 1634,
      "output_po": 1635,
      "output_ps": 1636,
      "output_upsh_pull": 1637,
      "chce": 1638,
      "chnnel": 1639,
      "output_open_dar": 1640,
      "output_open_dain": 1641,
      "output_open_drian": 1642,
      "wae": 1643,
      "waev": 1644,
      "input_pull_own": 1645,
      "when": 1646,
      "whta": 1647,
      "addti": 1648,
      "readig": 1649,
      "senos": 1650,
      "sensr": 1651,
      "ceck": 1652,
      "plse": 1653,
      "pluse": 1654,
      "trned": 1655,
      "tial": 1656,
      "viate": 1657,
      "perio": 1658,
      "perpare": 1659,
      "percet": 1660,
      "periper": 1661,
      "input_fl": 1662,
      "input_fla": 1663,
      "_upll": 1664,
      "etablish": 1665,
      "millseconds": 1666,
      "millies": 1667,
      "blocknig": 1668,
      "milliseonds": 1669,
      "flsh": 1670,
      "flsa": 1671,
      "tim2en": 1672,
      "tim3en": 1673,
      "tim3ms": 1674,
      "drie": 1675,
      "timer_p": 1676,
      "timer_delay": 1677,
      "colel": 1678,
      "digtial": 1679,
      "signls": 1680,
      "signlas": 1681,
      "signasl": 1682,
      "runinng": 1683,
      "comple": 1684,
      "icstion": 1685,
      "spred": 1686,
      "throgu": 1687,
      "throuhg": 1688,
      "prpare": 1689,
      "pration": 1690,
      "prdo": 1691,
      "proram": 1692,
      "oscil": 1693,
      "oscllate": 1694,
      "bein": 1695,
      "befo": 1696,
      "produe": 1697,
      "produec": 1698,
      "precent": 1699,
      "presca": 1700,
      "ouput_open_drain": 1701,
      "rxecution": 1702,
      "sable": 1703,
      "saple": 1704,
      "samp": 1705,
      "ectuion": 1706,
      "istr": 1707,
      "rnet": 1708,
      "rnning": 1709,
      "acivate": 1710,
      "exeuc": 1711,
      "exectuion": 1712,
      "uart1": 1713,
      "uart2": 1714,
      "uart3": 1715,
      "buadrate": 1716,
      "peiod": 1717,
      "executoin": 1718,
      "word": 1719,
      "progar": 1720,
      "repeaedly": 1721,
      "capure": 1722,
      "alternate_push_pull": 1723,
      "interal": 1724,
      "intervl": 1725,
      "operta": 1726,
      "opertion": 1727,
      "captue": 1728,
      "captuer": 1729,
      "ungae": 1730,
      "sqare": 1731,
      "estabish": 1732,
      "softa": 1733,
      "sofware": 1734,
      "squaer": 1735,
      "softwre": 1736,
      "softwae": 1737,
      "waveform": 1738,
      "even": 1739,
      "commuication": 1740,
      "commnuication": 1741,
      "collet": 1742,
      "collct": 1743,
      "regiset": 1744,
      "regsiter": 1745,
      "registr": 1746,
      "arrivig": 1747,
      "arrivign": 1748,
      "monitr": 1749,
      "input_floaing": 1750,
      "input_floait": 1751,
      "0x00": 1752,
      "0x38": 1753,
      "0x10": 1754,
      "0x14": 1755,
      "0x20": 1756,
      "0x28": 1757,
      "0x18": 1758,
      "0x1c": 1759,
      "dain": 1760,
      "apb1": 1761,
      "apb2": 1762,
      "currnet": 1763,
      "ilseconds": 1764,
      "oepration": 1765,
      "2808": 1766,
      "additionlly": 1767,
      "drven": 1768,
      "curret": 1769,
      "diigtal": 1770,
      "disable": 1771,
      "tmie": 1772,
      "output_push_upll": 1773,
      "thruo": 1774,
      "0x40021000": 1775,
      "inpt_floating": 1776,
      "inpt_pull_down": 1777,
      "sotware": 1778,
      "inpu_floating": 1779,
      "additionalyl": 1780,
      "idcally": 1781,
      "inut_pull_down": 1782,
      "blokcing": 1783,
      "d_rain": 1784,
      "incomign": 1785,
      "input_pul_ld": 1786,
      "drievn": 1787,
      "inptu_pull_down": 1788,
      "mililseconds": 1789,
      "ocsill": 1790,
      "turend": 1791,
      "activtae": 1792,
      "input_floatig": 1793,
      "input_floatng": 1794,
      "input_floatnig": 1795,
      "bolcking": 1796,
      "iopaen": 1797,
      "iopben": 1798,
      "iopcen": 1799,
      "iopden": 1800,
      "swtch": 1801,
      "sginal": 1802,
      "sginals": 1803,
      "tuned": 1804,
      "blcking": 1805,
      "millisecons": 1806,
      "gpio_output": 1807,
      "gpio_input": 1808,
      "gpio_read": 1809,
      "gpio_toggle": 1810,
      "preiodically": 1811,
      "implment": 1812,
      "cature": 1813,
      "iput_pull_up": 1814,
      "inteval": 1815,
      "incoing": 1816,
      "usart2en": 1817,
      "usart1en": 1818,
      "usart3en": 1819,
      "input_pll_up": 1820,
      "input_upll_down": 1821,
      "input_ull_down": 1822,
      "rcc_enable": 1823,
      "rcc_apb2enr": 1824,
      "rcc_apb1enr": 1825,
      "uart_transmit": 1826,
      "uart_receive": 1827,
      "uart_init": 1828,
      "execuion": 1829,
      "progrm": 1830,
      "implemet": 1831,
      "implemnt": 1832,
      "implemnet": 1833,
      "communicstion": 1834,
      "0x04": 1835,
      "0x08": 1836,
      "0x0c": 1837,
      "voltge": 1838,
      "voltgae": 1839,
      "voltsge": 1840,
      "additioanlly": 1841,
      "output_push_ull": 1842,
      "outptu_push_pull": 1843,
      "0x40000400": 1844,
      "0x40000800": 1845,
      "0x40000000": 1846,
      "0x40010400": 1847,
      "0x40010800": 1848,
      "0x40010c00": 1849,
      "something": 1850,
      "somrthing": 1851,
      "peirodically": 1852,
      "ambig": 1853,
      "lgic": 1854,
      "lgoic": 1855,
      "ovre": 1856,
      "ovrr": 1857,
      "snese": 1858,
      "uous": 1859,
      "output_open_r": 1860,
      "output_opend_rain": 1861,
      "perodically": 1862,
      "perido": 1863,
      "peroidically": 1864,
      "tim4ms": 1865,
      "tim4en": 1866,
      "byts": 1867,
      "bytse": 1868,
      "begni": 1869,
      "actvate": 1870,
      "actviate": 1871,
      "messaeg": 1872,
      "repeatdly": 1873,
      "repeatdely": 1874,
      "chekc": 1875,
      "periodicalyl": 1876,
      "soemthing": 1877,
      "0x24": 1878,
      "0x2c": 1879,
      "0x34": 1880,
      "0x3c": 1881,
      "0x40004400": 1882,
      "0x40004000": 1883,
      "0x40011000": 1884,
      "0x40013800": 1885,
      "valid_parti": 1886,
      "valid_comple": 1887,
      "partiy": 1888,
      "after": 1889,
      "bfufer": 1890,
      "bock": 1891,
      "budrate": 1892,
      "crurent": 1893,
      "cpture": 1894,
      "deect": 1895,
      "dgital": 1896,
      "dteect": 1897,
      "estbalish": 1898,
      "esablish": 1899,
      "eexcution": 1900,
      "estalbish": 1901,
      "frequ": 1902,
      "falsh": 1903,
      "hodl": 1904,
      "litsen": 1905,
      "lveel": 1906,
      "msesage": 1907,
      "none": 1908,
      "rgeister": 1909,
      "rpeeatedly": 1910,
      "sitch": 1911,
      "sigals": 1912,
      "srtting": 1913,
      "siwtch": 1914,
      "snesor": 1915,
      "inocming": 1916,
      "incmoing": 1917,
      "invalid": 1918,
      "inetrval": 1919,
      "outputpush_pull": 1920,
      "reigster": 1921,
      "resding": 1922,
      "inputp_ull_up": 1923,
      "leevl": 1924,
      "blunking": 1925,
      "sholud": 1926,
      "output_poen_drain": 1927,
      "output_psuh_pull": 1928,
      "chcek": 1929,
      "output_open_darin": 1930,
      "addtiionally": 1931,
      "senosr": 1932,
      "perioidcally": 1933,
      "percetn": 1934,
      "periperal": 1935,
      "input_flating": 1936,
      "input_flaoting": 1937,
      "milliesconds": 1938,
      "flsah": 1939,
      "timer_pwm": 1940,
      "colelct": 1941,
      "throguh": 1942,
      "prdouce": 1943,
      "oscilalte": 1944,
      "before": 1945,
      "prescaler": 1946,
      "sampel": 1947,
      "exeuction": 1948,
      "progarm": 1949,
      "intervla": 1950,
      "opertaion": 1951,
      "softawre": 1952,
      "regisetr": 1953,
      "input_floaitng": 1954,
      "28080": 1955,
      "thruogh": 1956,
      "input_pul_ldown": 1957,
